Repository: victor-kiptoo-001/QuickPass
Catalog: lib/l10n/app_*.arb
Languages: sw

# welcomeMessage
source: Welcome to QuickPass!
sw: Karibu QuickPass!

source: Phone Number
sw: Nambari ya Simu

# enterPhone
source: Enter your phone number
sw: Ingiza nambari yako ya simu

source: Request OTP
sw: Omba OTP

# otpSent
source: OTP sent to your phone
sw: OTP imetumwa kwenye simu yako

source: Verify OTP
sw: Thibitisha OTP

# enterOtp
source: Enter 6-digit OTP
sw: Ingiza OTP ya tarakimu 6

source: Invalid OTP
sw: OTP si sahihi

# loginSuccess
source: Login successful!
sw: Umefanikiwa kuingia!

source: Logout
sw: Toka

source: Cart
sw: Rukwama

source: Scan Item
sw: Changanua Bidhaa

source: Add to Cart
sw: Ongeza kwenye Rukwama

source: Update Cart
sw: Sasisha Rukwama

# cartEmpty
source: Your cart is empty
sw: Rukwama lako ni tupu

# cartItemAdded
source: Item added to cart
sw: Bidhaa imeongezwa kwenye rukwama

# cartLimitReached
source: Cart limit of {limit} items reached
sw: Kikomo cha rukwama cha bidhaa {limit} kimefikiwa

# totalPrice
source: Total: KSH {amount}
sw: Jumla: KSH {amount}

source: Proceed to Pay
sw: Endelea Kulipa

source: Payment
sw: Malipo

source: Cart Summary
sw: Muhtasari wa Rukwama

source: Total
sw: Jumla

source: Select Payment Method
sw: Chagua Njia ya Kulipa

source: Card
sw: Kadi

source: Loyalty Points
sw: Pointi za Uaminifu

source: Card Number
sw: Nambari ya Kadi

source: Expiry
sw: Muda wa Kuisha

source: Points to Redeem
sw: Pointi za Kukomboa

source: Pay Now
sw: Lipa Sasa

# errorPayment
source: Payment failed: {message}
sw: Malipo yameshindikana: {message}

source: Exit Verification
sw: Uthibitisho wa Kutoka

# showQrToExit
source: Show this QR code to exit
sw: Onyesha msimbo huu wa QR ili utoke

# timeLeft
source: Time left: {time}
sw: Muda uliosalia: {time}

# qrExpired
source: QR code expired
sw: Msimbo wa QR umeisha muda

# errorFetchingQr
source: Failed to fetch QR code
sw: Imeshindikana kupata msimbo wa QR

source: Share Receipt
sw: Shiriki Risiti

source: Download Receipt
sw: Pakua Risiti

# shareReceiptMessage
source: Here is your QuickPass receipt: {url}
sw: Hii ni risiti yako ya QuickPass: {url}

# receiptDownloaded
source: Receipt downloaded: {url}
sw: Risiti imepakuliwa: {url}

# errorSharingReceipt
source: Failed to share receipt
sw: Imeshindikana kushiriki risiti

# errorDownloadingReceipt
source: Failed to download receipt
sw: Imeshindikana kupakua risiti

# needHelp
source: Need help? Contact support
sw: Unahitaji msaada? Wasiliana na usaidizi

# contactSupport
source: Support contact coming soon
sw: Mawasiliano ya usaidizi yatakuja hivi karibuni

source: Retry
sw: Jaribu Tena

source: Your Points
sw: Pointi Zako

source: Points Balance
sw: Salio la Pointi

source: Redeem
sw: Komboa

source: Points History
sw: Historia ya Pointi

source: Points Earned
sw: Pointi Zilizopatikana

source: Points Redeemed
sw: Pointi Zilizokombolewa

# noHistory
source: No points history yet
sw: Hakuna historia ya pointi bado

# errorFetchingLoyalty
source: Failed to fetch loyalty data
sw: Imeshindikana kupata data ya uaminifu

# usePointsInPayment
source: Select loyalty points in payment screen
sw: Chagua pointi za uaminifu kwenye skrini ya malipo

source: Refresh
sw: Sasisha
